# StrUsage Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MassLevelData..::..StrUsage Property
MassLevelData Class See Also
---
A String which describes the usage or occupancy type of the level of the MassLevelData.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public string StrUsage { get; set; }
```

Visual Basic
---
```text
Public Property StrUsage As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ StrUsage {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
MassLevelData Class
Autodesk.Revit.DB.Analysis Namespace